import 'package:educator/presentation/theme/app_colors.dart';
import 'package:educator/presentation/views/components/components.dart';
import 'package:flutter/material.dart';

class FamilyDayDescription extends StatelessWidget {
  FamilyDayDescription({Key? key}) : super(key: key);
  String text =
      'والبيت المسلم المثالي فيه جلسة دورية أسبوعية تُعرض فيه أمور البيت الطعام واللباس والمسكن واللعب والهدايا والزيارات والرحلات والعقوبات والمكافئات ... و غير ذلك من أمور البيت يتصدر الأب رئاسة الجلسة، وتتولى الأم أمانة المجلس فتعرض خلاصة الجلسة السابقة، وتذكرهم بأهم القرارات السابقة والتي تتطلب المتابعة والتقويم  ثم يسجل كل فرد مقترحاته وقضاياه التي يريد طرحها على المجلس، ثم يبدأ الأب فالأم فالأبناء حسب تسلسل أعمارهم فتعرض القضية وتناقش ويتخذ فيها القرار ثم تختتم الجلسة بتلاوة القرارات المتفق عليها. إن بيتاً مثل هذا البيت سيقدم للأمة المسلمة أفراداً صالحين رضعوا العمل الجماعي منذ نعومة أظافرهم وتدربوا على الشورى منذ صغرهم وتعاونوا على البر والتقوى. \n كما يمكن أن يعقد في البيت برلمان صغير يقول الأولاد لأبيهم وأمهم مثلاً: لماذا لم نخرج للنزهة في الموعد المحدد لذلك؟ لماذا ضربتني ياأمي في الملاهي الأسبوع الماضي؟ ياأبي يضايقنا أسلوب معاملتك لأمنا في الفترة الأخيرة، وعدتموني بجائزة فور نجاحي ولم تحضروها لي، وغير ذلك من الأسئلة والاستفسارات التي يتجرأ الأبناء على قولها لآبائهم وأمهاتهم بأسلوب مهذب، ويرد الأبوان مثلاً: هذا كان بسبب كذا وكذا، نعتذر عن هذا ونعد بالا يتكرر، معك حق ولكنها اضطرتني لذلك بسبب ... سوف نفعل كذا وكذا \n .وليكن الحوار والنقاش هو سمت البيت يقوده الأب والام في هدوء وعقلانية ويساهم فيه الصغار ويتعودون عليه في احترام وأدب مع جرأة في قول الحق. وكذلك في الفصل يستطيع المدرس مساعدة الأبناء في عمل هذا البرلمان الصغير. \n "من كتاب فن تربية الأولاد في الأسلام للدكتور محمد سعيد مرسي"';
  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          backgroundColor: AppColors.secondary,
          title: const CustomText(size: true, text: 'يوم العائلة'),
        ),
        body: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(
              (MediaQuery.of(context).size.width) * 0.025,
            ),
            child: CustomText(
              size: false,
              text: text,
            ),
          ),
        ),
      ),
    );
  }
}
