import 'package:educator/presentation/views/components/components.dart';
import 'package:flutter/material.dart';

class TipsScreen extends StatelessWidget {
  const TipsScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          title: const CustomText(size: true, text: 'نصائح لك'),
        ),
        body: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(
              (MediaQuery.of(context).size.width) * 0.025,
            ),
            child: const CustomText(
              size: false,
              text:
                  'صفات المربي الأساسية: \n 1 الإخلاص \n على المربي أن يحرر نيته ويخلص لله في كل عمل تربوي يقوم به سواء أكان العمل أمراً أو نهياً أو نصحاً أو ملاحظة أو عقوبة. \n 2 التقوى \n وهي اتقاء عذاب الله بالمراقبة الدائمة لله والتزام المنهج الرباني في السر والعلن وبذل الجهد دوماً لتحري الحلال واجتناب الحرام. \n 3 العِلم \n ينبغي على المربي أن يكون عالماً في أصول التربية التي جاءت بها شريعة الإسلام وأن يكون محيطاً بأمور الحلال والحرام وأن يكون على دراية تامة بمبادئ الأخلاق وأن يكون متفهماً على العموم أنظمة الإسلام وقواعد الشريعة. \n 4 الحٍلم \n من الصفات الأساسية التي تساعد على إنجاح المربي في مهمته التربوية ومسؤوليته التكوينية والإصلاحية هي صفة الاتزان والحلم فبها ينجذب الولد نحو معلمه وبسببها يستجيب لأقوال مربيه وبواسطتها يتحلى بالآداب المحمودة ويتخلى عن الأخلاق المرذولة. \n 5 الاستشعار بالمسؤولية \n من الأمور التي يجب أن يدركها المربي جيداً وتتأصل في بؤرة شعوره ووجدانه استشعاره بمسؤوليته الكبرى في تربية الولد إيمانياً وسلوكياً وتكوينه جسمياً ونفسياً وإعداده عقليا واجتماعياً هذا الاستشعار يدفعه دائماً لأن ينطلق بكليته في مراقبة الولد وملاحظته وفي توجيهه وملاحقته وفي تعويده وتأديبه، وعليه أن يعتقد أنه إذا غفل عنه فترة وإذا تساهل عن ملاحظته مرة فإن الولد سيتدرج في الفساد خطوة خطة. \n من كتاب تربية الأولاد في الإسلام لعبد الله ناصح علوان \n \n القدوة الحسنة: \n أن تكون قدوة حسنة لأولادك يعني إذا أمرتهم فكن أول من يمتثل، وإذا نهيتهم فكن أول من ينتهي، والإسلام ينهى عن مخالفة الأفعال للاقوال، والقدوة مع الأطفال من أهم وسائل التربية، والطفل يجيد التقليد والمحاكاة، فالواجب على المربين أن يكونوا قدوة صالحة وليحذرالأبوان أن يرى منهم أبناؤهم فعلاً أو قولاً قبيحاً. \n وكثير من الآباء والأمهات يطلبون من أبنائهم أموراً هم بأنفسهم لا يطبقونها، ولنأخذ مثالاً على ذلك: يأمر الوالدان أبنائهم ان يستأذنوا عليهم إذا أرادوا دخول الغرفة، ولا يأخذوا شيئاً إلا باستئذان، ولكنهم يدخلان غرفة أبنائهم دون استئذان، وربما أخذوا بعض أدواتهم أيضاً دون إذن!، فكيف نطلب منهم أن يستأذنوا ونحن لانلتزم بذلك. \n ماذا لو طرقنا باب غرفتهم وطلبنا الإذن في الدخول، ثم نقول لهم: هكذا نحن نستأذن منكم وانتم يجب عليكم أن تفعلوا كذلك. \n واعلموا -معاشر الآباء والأمهات- أنه مهما قرأ أبناؤكم في مدارسهم وسمعوه منكم عن الأخلاق الفاضلة والقيم النبيلة فإنها ستظل غامضة في أذهانهم ومعلومات معشعشة في عقولهم مالم يروا في سلوكياتكم تجسيداً لها وفي واقعكم صورة واضحة لها، فكونوا قدوة حسنة لأبنائكم. \n من كتاب كيف تربي أبناءك لأحمد بن ناصر الطيّار',
            ),
          ),
        ),
      ),
    );
  }
}
