import 'package:educator/presentation/theme/app_colors.dart';
import 'package:educator/presentation/views/components/components.dart';
import 'package:flutter/material.dart';

class Ethics extends StatelessWidget {
  const Ethics({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          backgroundColor: AppColors.secondary,
          title:
              const CustomText(size: true, text: 'مسؤولية التربية الأخلاقية'),
        ),
        bottomNavigationBar: const Padding(
          padding: EdgeInsets.all(10.0),
          child: Text(
            "'من كتاب تربية الاولاد في الإسلام لعبد لله ناصح علوان'",
            style: TextStyle(
              color: Colors.grey,
              fontWeight: FontWeight.bold,
            ),
            //textAlign: TextAlign.right,
          ),
        ),
        body: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(
              (MediaQuery.of(context).size.width) * 0.025,
            ),
            child: const CustomText(
              size: false,
              text:
                  'نقصد بالتربية الخُلقية:  مجموعة المبادئ الخُلقية، والفضائل السلوكية والوجدانية التي يجب أن يتلقنها الطفل ويكتسبها ويعتاد عليها منذ تمييزه وتعقله إلى أن يصبح مكلفاً ألى أن يتدرج شاباً إلى أن يخوض خضّم الحياة \n ومما لا شك فيه ولا جدال معه أن الفضائل الخلقية والسلوكية والوجدانية هي ثمرة من ثمرات الإيمان الراسخ، والتنشئة الإيمانية الصحيحة فالطفل منذ نعومةأظفاره حين ينشأ على الإيمان بالله، ويتربى على الخشية منه، والمراقبة له، والاعتماد عليه، والاستعانة به، والتسليم لجنابه، فستصبح عنده الملكة الفطرية، والاستجابة الوجدانية لتقبّل كل فضيلة ومكرمة، والاعتياد على كل خلق فاضل كريم .. لأن الوازع الديني الذي تأصل في ضميره، والمراقبة الإلهية التي ترسخت في أعماق وجدانه، والمحاسبة النفسية التي سيطرت على تفكيره وإحساساته ..  كل ذلك بات حائلاً بين الطفل وبين الصفات القبيحة والعادات الآثمة المرذولة، والتقاليد الجاهلة الفاسدة .. بل إقباله على الخير يصبح عادة من عاداته، وتعشقه المكارم والفضائل يصير خلقاً أصيلاً من أبرز أخلاقه وصفاته .. \n \n ومسؤولية الآباء والأمهات في هذا المجال مسؤولية شاملة بكل مايتصل بإصلاح نفوسهم وتقويم اعوج جهم، وترفعهم عن الدنايا، وحسن معاملتهم للآخرين فهم مسؤولون عن تخليق الاولاد منذ الصغر على الصدق، والأمانة، والاستقامة، والإيثار، وإغاثة الملهوف، واحترام الكبير، وإكرام الضيف، والإحسان إلى الجار، والمحبة للآخرين ... ومسؤولون عن تنزيه ألسنتهم من السباب، والشتائم والكلمات النابية القبيحة، وعن كل ما ينبىء عن فساد الخلق، وسوء التربية ... ومسؤوولون عن ترفعهم عن دنايا الأمور، وسفاسف العادات، وقبائح الأخلاق، وعن كل مايحط بالمروءة والشرف والعفة ... ومسؤولون عن تعويدهم على مشاعر إنسانية كريمة، وإحساسات عاطفية نبيلة، كالإحسان إلى اليتامى، والبر بالفقراء، والعطف على الأرامل والمساكين .. إلى غير ذلك من هذه المسؤوليات الكبيرة الشاملة التي تتصل بالتهذيب، وترتبط بالأخلاق ... \n \n وإذا كانت التربية الفاضلية في نظر الإسلام تعتمد في الدرجة الأولى على قوة الملاحظة والمراقبة ... فجدير بالآباء والأمهاتى والمعلمين، وكل من يهمه أمر التربية والأخلاق .. ان يلحظوا في الأولاد ظواهر اربعة، وأن يعيروها اهتمامهم لكونها من أقبح الأعمال، وأحط الأخلاق وأرذل الصفات .. \n وهذه الظواهر مرتبة كما يلي: \n 1ظاهرة الكذب \n (وإذا كانت التربية الفاضلة في نظر المربين تعتمد على القدوة الصالحة .. فجدير بكل مرب مسؤول ألا يكذب على أطفاله بحجة إسكاتهم من بكاء، أو ترغيبهم في أمر أو تسكينهم من غضب .. فإنهم إن فعلوا ذلك يكونون قد عوّدوهم عن طريق الإيحاء والمحاكاة والقدوة السيئة أقبح العادات، وأرذل الأخلاق ألا وهي رذيلة الكذب .. عدا عن أنهم يفقدون الثقة بأقوالهم، ويضعف جانب التأثير بنصائحهم ومواعظهم) \n 2ظاهرة السرقة \n 3ظاهرة السباب والشتائم \n 4ظاهرة الميوعة والانحلال \n \n ومن أهم المبادئ الصحيحة في تربية الأبناء على الخلق القويم: \n 1التحذير من التشبه والتقليد الأعمى \n 2النهي عن الاستغراق في التنعم \n 3النهي عن الاستماع إلى الموسيقى والغناء الخليع \n 4النهي عن التخنث والتشبه بالنساء \n 5النهي عن السفور والتبرج والاختلاط والنظر إلى المحرمات',
            ),
          ),
        ),
      ),
    );
  }
}
