import 'package:educator/presentation/theme/app_colors.dart';
import 'package:educator/presentation/views/components/components.dart';
import 'package:flutter/material.dart';

class Faith extends StatelessWidget {
  const Faith({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          backgroundColor: AppColors.secondary,
          title:
              const CustomText(size: true, text: 'مسؤولية التربية الإيمانية'),
        ),
        bottomNavigationBar: const Padding(
          padding: EdgeInsets.all(5.0),
          child: Text(
            "'من كتاب تربية الاولاد في الإسلام لعبد لله ناصح علوان'",
            style: TextStyle(
              color: Colors.grey,
              fontWeight: FontWeight.bold,
            ),
            //textAlign: TextAlign.right,
          ),
        ),
        body: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(
              (MediaQuery.of(context).size.width) * 0.025,
            ),
            child: const CustomText(
              size: false,
              text:
                  'المقصود بالتربية الإيمانية: ربط الولد منذ تعقله بأصول الإيمان، وتعويده منذ تفهمه أركان الإسلام، وتعليمه من حين تمييزه مبادئ الشريعة الغراء \n ونعني بأصول الإيمان: كل ماثبت عن طريق الخبر الصادق من الحقائق الإيمانية، والأمور الغيبية كالإيمان بالله سبحانه، والإيمان بالملائكة، والإيمان بالكتب السماوية، والإيمان بالرسل جميعاً ... والإيمان بسؤال الملكين، وعذاب القبر، والبعث، والحساب، والجنة، والنار .. وسائر المغيبات \n ونعني بأركان الإسلام: \ كل العبادات البدنية والمالية، وهي الصلاة، والصوم، والزكاة، والحج من استطاع إليه سبيلا \n ونعني بمبادئ الشريعة: \ كل مايتصل بالمنهج الرباني، وتعاليم الإسلام من عقيدة، وعبادة، وأخلاق، وتشريع، وأنظمة، وأحكام .. \n \n وحدود هذه المسؤولية مرتبة على الشكل التالي: \n 1أن يرشدوهم إلى الإيمان بالله، وقدرته المعجزة، وإبداعه الرائع عن طريق التأمل والتفكير في خلق السموات والأرض وذلك في سن الإدراك والتمييز، ويحسن أن يتدرجوا معهم من المحسوس إلى المعقول، ومن الجزئي إلى الكلي، ومن البسيط إلى المركب حتى يصلوا معهم في نهاية الشوط إلى قضية الإيمان عن اقتناع وحجة وبرهان وحين يأخذ الولد منذ الصغر القض يا الإيمانية الثابتة وتنصب في ذهنه وفكره الأدلة التوحيدية الراسخة فلا تستطيع معاول الهدم أن تنال من قلبه العامرولا يمكن لدعاة السوء أن يؤثروا على عقله الناضج، ولا يقدر إنسان أن يزعزع نفسيته المؤمنة لما وصل إليه من إيمان ثابت ويقين راسخ وقناعة كاملة \n 2أن يغرسوا في نفوسهم روح الخشوع والتقوى والعبودية لله رب العالمين: وذلك بتفتيح بصائرهم على القدرة المعجزة، والملكوت الهائل الكبير في كل شيء .. في الدقيق والكبير .. في الجامد والحي .. في النبتة النابتة والشجرة النامية ..  في الزهرة الفواحة البديعة الألوان ..في ملايين الملايين من الخلائق العجيبة الصنع، البديعة التكوين ..  فما يملك القلب إزاء ذلك إلا أن يخشع ويهتز لعظمة الله، وما تملك النفس تجاه هذا إلا أن تحس بتقوى الله ومراقبته، وأن تشعر بكليتها وقرارة وجدانها بلذة الطاعة وحلاوة العبادة لله رب العالمين \n 3أن يربوا فيهم روح المراقبة لله سبحانه في كل تصرفاتهم وأحوالهم وذلك بترويض الولد على أن الله سبحانه يراقبه ويراه، ويعلم سر ونجواه، ويعلم خائنة الأعين وماتخفي الصدور وتخليق الولد على مراقبة الله تعالى يجب أن تكون غاية المربي وهمّه وهدفه الأكبر وذلك لا يكون إلا في ترويض الولد عليها وهو يعمل، وترويضه عليها وهو يفكر، وترويضه عليها وهو يحس \n \n ومن وصايا الرسول صلى الله عليه وسلم: \n 1أمره  بالفتح على الولد بكلمة لا إله إلا الله لتكون كلمة التوحيد، وشعار الدخول في الإسلام أول مايقرع سمع الطفل، وأول مايفصح بها لسانه، وأول مايتعقلها من الكلمات والألفاظ \n 2تعريفه أول مايعقل أحكام الحلال والحرام \n 3أمره بالعبادات وهو في سن السابعة \n 4تأديبه على حب رسول الله صلى الله عليه وسلم، وحب أل بيته، وتلاوة القرأن الكريم',
            ),
          ),
        ),
      ),
    );
  }
}
